"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Atpakot tekošajā mapē";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Atpakot uz darbvirsmas";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Atpakot mapē…";